Tekla Open API Reference for Tekla Structures 2025
LineTypes.GetHashCode Method
 Returns a hash code for the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
The hash code for the object.
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace